Revit 2027 API
Stairs.ActualRisersNumber Property
 The total number of actually created risers in model.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int ActualRisersNumber { get; }
Public ReadOnly Property ActualRisersNumber As Integer
	Get
public:
property int ActualRisersNumber {
	int get ();
}
member ActualRisersNumber : int with get
Property Value
Int32
Remarks
 The number of steps needed to go through when moving from the base level to the top level of the stairs.
See Also
Reference
Stairs Class
Autodesk.Revit.DB.Architecture Namespace